{
  "$comment": "GENERATED by scripts/sync-sign-vocabulary.js — do not edit by hand. Run `npm run sync:vocab`.",
  "generatedFrom": "frontend/src/components/SignAvatar.js",
  "totalSignable": 332,
  "excludedFromPrompt": [
    "BASICALLY",
    "ILL",
    "IM",
    "SUBSCRIBE",
    "THATS",
    "WELL",
    "YEAH",
    "YOURE",
    "YOUVE"
  ],
  "signable": [
    "ABLE",
    "ABOUT",
    "ACCORDING",
    "ACCURACY",
    "ACTIVATE",
    "ACTIVE",
    "ACTUALLY",
    "ADD",
    "AFTER",
    "AGAIN",
    "ALL",
    "ALMOST",
    "ALSO",
    "ALWAYS",
    "ANALOGY",
    "AND",
    "ANOTHER",
    "ANSWER",
    "ANY",
    "AROUND",
    "AS",
    "ASK",
    "ASL",
    "ASSOCIATED",
    "BACK",
    "BAD",
    "BASICALLY",
    "BECAUSE",
    "BEFORE",
    "BEHAVE",
    "BEHAVIOR",
    "BETWEEN",
    "BIG",
    "BIGGER",
    "BRAIN",
    "BREAK",
    "BRIGHT",
    "BRING",
    "BUILD",
    "BUNCH",
    "BUT",
    "BY",
    "CALCULATE",
    "CALL",
    "CAN",
    "CARE",
    "CAUSE",
    "CERTAIN",
    "CHALLENGE",
    "CHANGE",
    "CHOICE",
    "CHOOSE",
    "CHOSE",
    "CLASSIFY",
    "CLOSE",
    "COMBINE",
    "COME",
    "COMMON",
    "COMPLICATED",
    "COMPONENT",
    "COMPUTE",
    "COMPUTER",
    "CONNECT",
    "CONNECTION",
    "CONTINUE",
    "CORRESPOND",
    "COUPLE",
    "COURSE",
    "DATA",
    "DAY",
    "DEEP",
    "DETERMINE",
    "DIAL",
    "DID",
    "DIFFERENT",
    "DIFFICULT",
    "DIGIT",
    "DO",
    "DONT",
    "DOWN",
    "EACH",
    "EASY",
    "EDGE",
    "EITHER",
    "END",
    "ENTIRE",
    "ERROR",
    "EVEN",
    "EXACTLY",
    "EXAMPLE",
    "EXPECT",
    "EXPERIMENT",
    "EXPLAIN",
    "EXPRESSION",
    "EXTREME",
    "FEED",
    "FEEL",
    "FINAL",
    "FIND",
    "FINISH",
    "FIRING",
    "FIRST",
    "FOR",
    "FORM",
    "FULL",
    "FUNCTION",
    "GET",
    "GIVE",
    "GIVEN",
    "GO",
    "GOAL",
    "GOOD",
    "GRADIENT",
    "GROUP",
    "HAND",
    "HANDWRITTEN",
    "HARD",
    "HE",
    "HELLO",
    "HELP",
    "HERE",
    "HIDDEN",
    "HIGH",
    "HOLD",
    "HOPE",
    "HOW",
    "I",
    "IDEA",
    "IF",
    "ILL",
    "IM",
    "IMAGE",
    "IMAGINE",
    "IMPORTANT",
    "INACTIVE",
    "INDICATE",
    "INFLUENCE",
    "INPUT",
    "INSIDE",
    "INTO",
    "INVOLVE",
    "IT",
    "JUMP",
    "JUST",
    "KEEP",
    "KIND",
    "KNOB",
    "KNOW",
    "LAST",
    "LAYER",
    "LEARN",
    "LESS",
    "LET",
    "LETS",
    "LETTER",
    "LEVEL",
    "LIGHT",
    "LIKE",
    "LINE",
    "LINEAR",
    "LITTLE",
    "LONG",
    "LOOK",
    "LOOP",
    "LOSS",
    "LOT",
    "LOW",
    "MACHINE",
    "MAKE",
    "MANY",
    "MATH",
    "MATRIX",
    "MAYBE",
    "ME",
    "MEAN",
    "MECHANISM",
    "MIDDLE",
    "MODEL",
    "MODERN",
    "MOMENT",
    "MORE",
    "MOTIVATED",
    "MUCH",
    "NEED",
    "NEGATIVE",
    "NETWORK",
    "NEURAL",
    "NEURON",
    "NEW",
    "NEXT",
    "NICE",
    "NO",
    "NODE",
    "NOT",
    "NOW",
    "NUMBER",
    "OFF",
    "OLD",
    "ONCE",
    "ONE",
    "OR",
    "ORGANIZE",
    "OTHER",
    "OUR",
    "OUT",
    "OUTPUT",
    "OWN",
    "PARAMETER",
    "PART",
    "PARTICULAR",
    "PATTERN",
    "PEOPLE",
    "PICK",
    "PIECE",
    "PIXEL",
    "PLACE",
    "PLEASE",
    "POINT",
    "POSITIVE",
    "PREDICT",
    "PREVIOUS",
    "PROBABILITY",
    "PROBLEM",
    "PROCESS",
    "PRODUCT",
    "PROGRAM",
    "PUT",
    "QUESTION",
    "RATHER",
    "READ",
    "REALLY",
    "REASON",
    "REASONABLE",
    "RECOGNITION",
    "RECOGNIZE",
    "REGION",
    "RELEVANT",
    "REMEMBER",
    "REPRESENT",
    "RESULT",
    "RIGHT",
    "SAID",
    "SAME",
    "SAY",
    "SECOND",
    "SEE",
    "SERIES",
    "SETTING",
    "SHE",
    "SHOW",
    "SIGN",
    "SIGNAL",
    "SIMPLE",
    "SMALL",
    "SO",
    "SOLUTION",
    "SOME",
    "SORRY",
    "SORT",
    "SPECIFIC",
    "START",
    "STAY",
    "STEP",
    "STILL",
    "STOP",
    "STRUCTURE",
    "STUDY",
    "SUBSCRIBE",
    "SUM",
    "SURROUNDING",
    "SYSTEM",
    "TAKE",
    "TALK",
    "TEACH",
    "TELL",
    "THAN",
    "THANK",
    "THATS",
    "THEIR",
    "THEN",
    "THERE",
    "THESE",
    "THEY",
    "THING",
    "THINK",
    "THIRD",
    "THOSE",
    "TIME",
    "TOGETHER",
    "TOP",
    "TOTAL",
    "TOWARDS",
    "TRAIN",
    "TRUE",
    "TRY",
    "TWO",
    "TYPE",
    "UNDERSTAND",
    "UP",
    "USE",
    "VALUE",
    "VARIANT",
    "VARIOUS",
    "VECTOR",
    "VERY",
    "VIDEO",
    "WANT",
    "WAY",
    "WE",
    "WEIGHT",
    "WELL",
    "WHAT",
    "WHEN",
    "WHERE",
    "WHETHER",
    "WHICH",
    "WHO",
    "WHY",
    "WORD",
    "WORK",
    "WORLD",
    "WRAP",
    "WRITE",
    "WRONG",
    "YEAH",
    "YEAR",
    "YES",
    "YOU",
    "YOUR",
    "YOURE",
    "YOUVE",
    "ZERO"
  ],
  "vocabulary": [
    "ABLE",
    "ABOUT",
    "ACCORDING",
    "ACCURACY",
    "ACTIVATE",
    "ACTIVE",
    "ACTUALLY",
    "ADD",
    "AFTER",
    "AGAIN",
    "ALL",
    "ALMOST",
    "ALSO",
    "ALWAYS",
    "ANALOGY",
    "AND",
    "ANOTHER",
    "ANSWER",
    "ANY",
    "AROUND",
    "AS",
    "ASK",
    "ASL",
    "ASSOCIATED",
    "BACK",
    "BAD",
    "BECAUSE",
    "BEFORE",
    "BEHAVE",
    "BEHAVIOR",
    "BETWEEN",
    "BIG",
    "BIGGER",
    "BRAIN",
    "BREAK",
    "BRIGHT",
    "BRING",
    "BUILD",
    "BUNCH",
    "BUT",
    "BY",
    "CALCULATE",
    "CALL",
    "CAN",
    "CARE",
    "CAUSE",
    "CERTAIN",
    "CHALLENGE",
    "CHANGE",
    "CHOICE",
    "CHOOSE",
    "CHOSE",
    "CLASSIFY",
    "CLOSE",
    "COMBINE",
    "COME",
    "COMMON",
    "COMPLICATED",
    "COMPONENT",
    "COMPUTE",
    "COMPUTER",
    "CONNECT",
    "CONNECTION",
    "CONTINUE",
    "CORRESPOND",
    "COUPLE",
    "COURSE",
    "DATA",
    "DAY",
    "DEEP",
    "DETERMINE",
    "DIAL",
    "DID",
    "DIFFERENT",
    "DIFFICULT",
    "DIGIT",
    "DO",
    "DONT",
    "DOWN",
    "EACH",
    "EASY",
    "EDGE",
    "EITHER",
    "END",
    "ENTIRE",
    "ERROR",
    "EVEN",
    "EXACTLY",
    "EXAMPLE",
    "EXPECT",
    "EXPERIMENT",
    "EXPLAIN",
    "EXPRESSION",
    "EXTREME",
    "FEED",
    "FEEL",
    "FINAL",
    "FIND",
    "FINISH",
    "FIRING",
    "FIRST",
    "FOR",
    "FORM",
    "FULL",
    "FUNCTION",
    "GET",
    "GIVE",
    "GIVEN",
    "GO",
    "GOAL",
    "GOOD",
    "GRADIENT",
    "GROUP",
    "HAND",
    "HANDWRITTEN",
    "HARD",
    "HE",
    "HELLO",
    "HELP",
    "HERE",
    "HIDDEN",
    "HIGH",
    "HOLD",
    "HOPE",
    "HOW",
    "I",
    "IDEA",
    "IF",
    "IMAGE",
    "IMAGINE",
    "IMPORTANT",
    "INACTIVE",
    "INDICATE",
    "INFLUENCE",
    "INPUT",
    "INSIDE",
    "INTO",
    "INVOLVE",
    "IT",
    "JUMP",
    "JUST",
    "KEEP",
    "KIND",
    "KNOB",
    "KNOW",
    "LAST",
    "LAYER",
    "LEARN",
    "LESS",
    "LET",
    "LETS",
    "LETTER",
    "LEVEL",
    "LIGHT",
    "LIKE",
    "LINE",
    "LINEAR",
    "LITTLE",
    "LONG",
    "LOOK",
    "LOOP",
    "LOSS",
    "LOT",
    "LOW",
    "MACHINE",
    "MAKE",
    "MANY",
    "MATH",
    "MATRIX",
    "MAYBE",
    "ME",
    "MEAN",
    "MECHANISM",
    "MIDDLE",
    "MODEL",
    "MODERN",
    "MOMENT",
    "MORE",
    "MOTIVATED",
    "MUCH",
    "NEED",
    "NEGATIVE",
    "NETWORK",
    "NEURAL",
    "NEURON",
    "NEW",
    "NEXT",
    "NICE",
    "NO",
    "NODE",
    "NOT",
    "NOW",
    "NUMBER",
    "OFF",
    "OLD",
    "ONCE",
    "ONE",
    "OR",
    "ORGANIZE",
    "OTHER",
    "OUR",
    "OUT",
    "OUTPUT",
    "OWN",
    "PARAMETER",
    "PART",
    "PARTICULAR",
    "PATTERN",
    "PEOPLE",
    "PICK",
    "PIECE",
    "PIXEL",
    "PLACE",
    "PLEASE",
    "POINT",
    "POSITIVE",
    "PREDICT",
    "PREVIOUS",
    "PROBABILITY",
    "PROBLEM",
    "PROCESS",
    "PRODUCT",
    "PROGRAM",
    "PUT",
    "QUESTION",
    "RATHER",
    "READ",
    "REALLY",
    "REASON",
    "REASONABLE",
    "RECOGNITION",
    "RECOGNIZE",
    "REGION",
    "RELEVANT",
    "REMEMBER",
    "REPRESENT",
    "RESULT",
    "RIGHT",
    "SAID",
    "SAME",
    "SAY",
    "SECOND",
    "SEE",
    "SERIES",
    "SETTING",
    "SHE",
    "SHOW",
    "SIGN",
    "SIGNAL",
    "SIMPLE",
    "SMALL",
    "SO",
    "SOLUTION",
    "SOME",
    "SORRY",
    "SORT",
    "SPECIFIC",
    "START",
    "STAY",
    "STEP",
    "STILL",
    "STOP",
    "STRUCTURE",
    "STUDY",
    "SUM",
    "SURROUNDING",
    "SYSTEM",
    "TAKE",
    "TALK",
    "TEACH",
    "TELL",
    "THAN",
    "THANK",
    "THEIR",
    "THEN",
    "THERE",
    "THESE",
    "THEY",
    "THING",
    "THINK",
    "THIRD",
    "THOSE",
    "TIME",
    "TOGETHER",
    "TOP",
    "TOTAL",
    "TOWARDS",
    "TRAIN",
    "TRUE",
    "TRY",
    "TWO",
    "TYPE",
    "UNDERSTAND",
    "UP",
    "USE",
    "VALUE",
    "VARIANT",
    "VARIOUS",
    "VECTOR",
    "VERY",
    "VIDEO",
    "WANT",
    "WAY",
    "WE",
    "WEIGHT",
    "WHAT",
    "WHEN",
    "WHERE",
    "WHETHER",
    "WHICH",
    "WHO",
    "WHY",
    "WORD",
    "WORK",
    "WORLD",
    "WRAP",
    "WRITE",
    "WRONG",
    "YEAR",
    "YES",
    "YOU",
    "YOUR",
    "ZERO"
  ]
}
